In [2]:
import numpy as np
import pandas as pd

## 2 A) How to work with missing data?

we can work with missing data in many ways but most common approaches are
<center><b>i)Removing Missing Data</b></center>
<center><b>ii)Modifying The Missing Data</b></center>
we can modify the data by replacing the missing value, with it's central tendency, such as mean, median, mode
this depends on whether the data is nominal, ordinal, interval or ratio
we can choose either filling the missing data with measure of central tendency or use ffill or bfill or use Imputation i.e fillna()

## B) Write a Python code to perform Data pre-processing task on given dataset
pre-process_datasample.csv (eg. Checking and Handling Missing Data, handling inappropriate data)

In [3]:
df = pd.read_csv("pre-process_datasample.csv")
df

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8      NaN  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [12]:
#print true if you find any missing data according to row wise
df.isna().any(axis=1)

0    False
1    False
2    False
3    False
4     True
5    False
6     True
7    False
8     True
9    False
dtype: bool

## Method-1 : Dropping Missing values

In [13]:
df_01 = df.dropna()

In [14]:
df_01

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
5   France  35.0  58000.0       Yes
7   France  48.0  79000.0       Yes
9   France  37.0  67000.0       Yes

## Method-2: Modify

#### We can see that Country is an ordinal data type so we can only perform Mode operation to replace it
We can also see that Salary, Age is an continuous data, we can either proceed with mean or median, prefer median when there are too many outliers, when standard deviation is too high

In [33]:
# replace with mean for salary and age

df_02 = df.fillna({
    'Age':df['Age'].mean(),
    'Salary':df['Salary'].mean(),
    'Country' : df['Country'].mode()[0]
})

In [34]:
df_02

   Country        Age        Salary Purchased
0   France  44.000000  72000.000000        No
1    Spain  27.000000  48000.000000       Yes
2  Germany  30.000000  54000.000000        No
3    Spain  38.000000  61000.000000        No
4  Germany  40.000000  63777.777778       Yes
5   France  35.000000  58000.000000       Yes
6    Spain  38.777778  52000.000000        No
7   France  48.000000  79000.000000       Yes
8   France  50.000000  83000.000000        No
9   France  37.000000  67000.000000       Yes

In [35]:
df.iloc[:, 0].mode()

0    France
Name: Country, dtype: object